In [1]:
library(tidyverse)

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.5
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   3.5.1     ✔ tibble    3.2.1
✔ lubridate 1.9.3     ✔ tidyr     1.3.1
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

In [2]:
scores <- 
  tibble(
    name = c("mike", "carol", "greg", "marcia", "peter", "jan", "bobby", "cindy", "alice"),
    school = c("south", "south", "south", "south", "north", "north", "north", "south", "south"),
    teacher = c("johnson", "johnson", "johnson", "johnson",  "smith", "smith", "smith", "perry", "perry"),
    sex = c("male", "female", "male", "female", "male", "female", "male", "female", "female"),
    math_score = c(4, 3, 2, 4, 3, 4, 5, 4, 5),
    reading_score = c(1, 5, 2, 4, 5, 4, 1, 5, 4)
)

In [3]:
scores

  name   school teacher sex    math_score reading_score
1 mike   south  johnson male   4          1
2 carol  south  johnson female 3          5
3 greg   south  johnson male   2          2
4 marcia south  johnson female 4          4
5 peter  north  smith   male   3          5
6 jan    north  smith   female 4          4
7 bobby  north  smith   male   5          1
8 cindy  south  perry   female 4          5
9 alice  south  perry   female 5          4

In [7]:
scores %>%
    slice(1:3)

  name  school teacher sex    math_score reading_score
1 mike  south  johnson male   4          1
2 carol south  johnson female 3          5
3 greg  south  johnson male   2          2

In [8]:
scores %>%
    arrange(school, teacher, sex, math_score, reading_score)

  name   school teacher sex    math_score reading_score
1 jan    north  smith   female 4          4
2 peter  north  smith   male   3          5
3 bobby  north  smith   male   5          1
4 carol  south  johnson female 3          5
5 marcia south  johnson female 4          4
6 greg   south  johnson male   2          2
7 mike   south  johnson male   4          1
8 cindy  south  perry   female 4          5
9 alice  south  perry   female 5          4

In [9]:
scores %>%
    select(-sex)

  name   school teacher math_score reading_score
1 mike   south  johnson 4          1
2 carol  south  johnson 3          5
3 greg   south  johnson 2          2
4 marcia south  johnson 4          4
5 peter  north  smith   3          5
6 jan    north  smith   4          4
7 bobby  north  smith   5          1
8 cindy  south  perry   4          5
9 alice  south  perry   5          4

In [10]:
scores %>%
    select(-math_score, -reading_score)

  name   school teacher sex
1 mike   south  johnson male
2 carol  south  johnson female
3 greg   south  johnson male
4 marcia south  johnson female
5 peter  north  smith   male
6 jan    north  smith   female
7 bobby  north  smith   male
8 cindy  south  perry   female
9 alice  south  perry   female

In [12]:
scores %>%
    select(sex, everything())

  sex    name   school teacher math_score reading_score
1 male   mike   south  johnson 4          1
2 female carol  south  johnson 3          5
3 male   greg   south  johnson 2          2
4 female marcia south  johnson 4          4
5 male   peter  north  smith   3          5
6 female jan    north  smith   4          4
7 male   bobby  north  smith   5          1
8 female cindy  south  perry   4          5
9 female alice  south  perry   5          4

In [13]:
scores %>%
    filter(sex == "male" & school == "south")

  name school teacher sex  math_score reading_score
1 mike south  johnson male 4          1
2 greg south  johnson male 2          2

In [14]:
scores %>%
    filter(math_score > mean(math_score))

  name   school teacher sex    math_score reading_score
1 mike   south  johnson male   4          1
2 marcia south  johnson female 4          4
3 jan    north  smith   female 4          4
4 bobby  north  smith   male   5          1
5 cindy  south  perry   female 4          5
6 alice  south  perry   female 5          4

In [15]:
scores %>%
    filter(math_score >= 4 & reading_score >= 3)

  name   school teacher sex    math_score reading_score
1 marcia south  johnson female 4          4
2 jan    north  smith   female 4          4
3 cindy  south  perry   female 4          5
4 alice  south  perry   female 5          4

In [17]:
scores %>%
    filter(math_score <= 3 | reading_score <= 3)

  name  school teacher sex    math_score reading_score
1 mike  south  johnson male   4          1
2 carol south  johnson female 3          5
3 greg  south  johnson male   2          2
4 peter north  smith   male   3          5
5 bobby north  smith   male   5          1

In [24]:
scores %>%
    filter(reading_score == 2 | reading_score == 3 | reading_score == 4)

  name   school teacher sex    math_score reading_score
1 greg   south  johnson male   2          2
2 marcia south  johnson female 4          4
3 jan    north  smith   female 4          4
4 alice  south  perry   female 5          4

In [25]:
scores %>%
    filter(reading_score %in% 2:4)

  name   school teacher sex    math_score reading_score
1 greg   south  johnson male   2          2
2 marcia south  johnson female 4          4
3 jan    north  smith   female 4          4
4 alice  south  perry   female 5          4

In [28]:
scores %>%
    filter(substr(name,1,1) == "m")

  name   school teacher sex    math_score reading_score
1 mike   south  johnson male   4          1
2 marcia south  johnson female 4          4

In [30]:
scores %>%
    group_by(teacher) %>%
        filter(max(math_score) == 5)

  name  school teacher sex    math_score reading_score
1 peter north  smith   male   3          5
2 jan   north  smith   female 4          4
3 bobby north  smith   male   5          1
4 cindy south  perry   female 4          5
5 alice south  perry   female 5          4

In [32]:
scores %>%
    group_by(sex) %>%
        filter(mean(math_score) == 4)

  name   school teacher sex    math_score reading_score
1 carol  south  johnson female 3          5
2 marcia south  johnson female 4          4
3 jan    north  smith   female 4          4
4 cindy  south  perry   female 4          5
5 alice  south  perry   female 5          4

In [35]:
scores$math_score = scores$math_score * 10
scores$reading_score = scores$reading_score * 10

In [37]:
scores %>%
    mutate(math_reading_avg = (math_score +reading_score) / 2)

  name   school teacher sex    math_score reading_score math_reading_avg
1 mike   south  johnson male   400        10            205
2 carol  south  johnson female 300        50            175
3 greg   south  johnson male   200        20            110
4 marcia south  johnson female 400        40            220
5 peter  north  smith   male   300        50            175
6 jan    north  smith   female 400        40            220
7 bobby  north  smith   male   500        10            255
8 cindy  south  perry   female 400        50            225
9 alice  south  perry   female 500        40            270

In [38]:
scores %>%
    mutate(high_math_achiever = math_score >= 4)

  name   school teacher sex    math_score reading_score high_math_achiever
1 mike   south  johnson male   400        10            TRUE
2 carol  south  johnson female 300        50            TRUE
3 greg   south  johnson male   200        20            TRUE
4 marcia south  johnson female 400        40            TRUE
5 peter  north  smith   male   300        50            TRUE
6 jan    north  smith   female 400        40            TRUE
7 bobby  north  smith   male   500        10            TRUE
8 cindy  south  perry   female 400        50            TRUE
9 alice  south  perry   female 500        40            TRUE

In [39]:
scores %>%
    mutate(reading_score_centered = reading_score - mean(reading_score))

  name   school teacher sex    math_score reading_score reading_score_centered
1 mike   south  johnson male   400        10            -24.444444
2 carol  south  johnson female 300        50             15.555556
3 greg   south  johnson male   200        20            -14.444444
4 marcia south  johnson female 400        40              5.555556
5 peter  north  smith   male   300        50             15.555556
6 jan    north  smith   female 400        40              5.555556
7 bobby  north  smith   male   500        10            -24.444444
8 cindy  south  perry   female 400        50             15.555556
9 alice  south  perry   female 500        40              5.555556

In [40]:
scores %>%
    group_by(sex) %>%
    mutate(math_score_centered_by_sex = math_score - mean(math_score)) %>%
    arrange(desc(math_score_centered_by_sex))

  name   school teacher sex    math_score reading_score
1 bobby  north  smith   male   500        10
2 alice  south  perry   female 500        40
3 mike   south  johnson male   400        10
4 marcia south  johnson female 400        40
5 jan    north  smith   female 400        40
6 cindy  south  perry   female 400        50
7 peter  north  smith   male   300        50
8 carol  south  johnson female 300        50
9 greg   south  johnson male   200        20
  math_score_centered_by_sex
1  150
2  100
3   50
4    0
5    0
6    0
7  -50
8 -100
9 -150